<a href="https://colab.research.google.com/github/finesun16/netology_pyda_27_hw/blob/master/hw11_pandas_functions_groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Задание 1
Напишите функцию, которая классифицирует фильмы из материалов занятия по следующим правилам:
- оценка 2 и меньше - низкий рейтинг
- оценка 4 и меньше - средний рейтинг
- оценка 4.5 и 5 - высокий рейтинг

Результат классификации запишите в столбец class

In [1]:
import pandas as pd

In [61]:
rating = pd.read_csv('drive/MyDrive/Colab Notebooks/netology_pyda27_hw/data/ml-25m/ratings.csv')
rating.head(3)

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828

In [62]:
movies = pd.read_csv('drive/MyDrive/Colab Notebooks/netology_pyda27_hw/data/ml-25m/movies.csv')
movies.head(3)

   movieId  ...                                       genres
0        1  ...  Adventure|Animation|Children|Comedy|Fantasy
1        2  ...                   Adventure|Children|Fantasy
2        3  ...                               Comedy|Romance

[3 rows x 3 columns]

In [3]:
def classification (rating):
    """
    функция классификации рейтинга
    """
    if rating <= 2:
        return 'low'
    elif 2 < rating <= 4:
        return 'middle'
    return 'high'

In [63]:
# найдем среднее значение рейтинга для каждого фильма
df2 = rating.groupby('movieId').mean().rating.reset_index()
df2.head(3)

   movieId    rating
0        1  3.893708
1        2  3.251527
2        3  3.142028

In [64]:
df2['class']= df2.rating.apply(classification) # применим функцию классификации
df2.merge(movies, on='movieId', how='left')[['title', 'rating', 'class']] # выведем с названием фильма

                                    title    rating   class
0                        Toy Story (1995)  3.893708  middle
1                          Jumanji (1995)  3.251527  middle
2                 Grumpier Old Men (1995)  3.142028  middle
3                Waiting to Exhale (1995)  2.853547  middle
4      Father of the Bride Part II (1995)  3.058434  middle
...                                   ...       ...     ...
59042                           We (2018)  1.500000     low
59043           Window of the Soul (2001)  3.000000  middle
59044                    Bad Poems (2018)  4.500000    high
59045                 A Girl Thing (2001)  3.000000  middle
59046      Women of Devil's Island (1962)  3.000000  middle

[59047 rows x 3 columns]

## Задание 2
Используем файл keywords.csv.

Необходимо написать гео-классификатор, который каждой строке сможет выставить географическую принадлежность определенному региону. Т. е. если поисковый запрос содержит название города региона, то в столбце ‘region’ пишется название этого региона. Если поисковый запрос не содержит названия города, то ставим ‘undefined’.

Правила распределения по регионам Центр, Северо-Запад и Дальний Восток:

      geo_data = {

          'Центр': ['москва', 'тула', 'ярославль'],

          'Северо-Запад': ['петербург', 'псков', 'мурманск'],

          'Дальний Восток': ['владивосток', 'сахалин', 'хабаровск']
      
          }

Результат классификации запишите в отдельный столбец region.

In [32]:
geo_data = {

      'Центр': ['москва', 'тула', 'ярославль'],

      'Северо-Запад': ['петербург', 'псков', 'мурманск'],

      'Дальний Восток': ['владивосток', 'сахалин', 'хабаровск']

      }

In [35]:
kw = pd.read_csv('drive/MyDrive/Colab Notebooks/netology_pyda27_hw/data/ml-latest-small/keywords.csv')
kw.head(5)

         keyword     shows
0             вк  64292779
1  одноклассники  63810309
2          порно  41747114
3           ютуб  39995567
4      вконтакте  21014195

In [44]:
def geo(keyword):
    """
    функция для определения геопринадлежности запроса гео-региону
    """
    for key, values in geo_data.items():
        for city in values:
           if city in keyword.lower():
              return key
    return 'undefined'

In [45]:
kw['geo'] = kw.keyword.apply(geo)
kw[kw['geo'] != 'undefined']

                                     keyword   shows             geo
127                             авито москва  979292           Центр
370                 авито ру санкт петербург  425134    Северо-Запад
564                погода в санкт петербурге  292489    Северо-Запад
849                          авито ярославль  209581           Центр
1063                     фарпост владивосток  176951  Дальний Восток
...                                      ...     ...             ...
99590  авито ярославль автомобили с пробегом    3673           Центр
99634   северпост новости мурманской области    3606    Северо-Запад
99808      полармед мурманск запись на прием    3719    Северо-Запад
99890                    яндекс метро москва    4548           Центр
99922                      авто ру ярославль    3712           Центр

[747 rows x 3 columns]

##Задание 3 (бонусное)

Есть мнение, что “раньше снимали настоящее кино, не то что сейчас”. Ваша задача проверить это утверждение, используя файлы с рейтингами фильмов из прошлого домашнего занятия (файл movies.csv и ratings.csv из базы grouplens.org.../movielens). Т. е. проверить верно ли, что с ростом года выпуска фильма его средний рейтинг становится ниже.

При этом мы не будем затрагивать субьективные факторы выставления этих рейтингов, а пройдемся по следующему алгоритму:

В переменную years запишите список из всех годов с 1950 по 2010.

Напишите функцию production_year, которая каждой строке из названия фильма выставляет год выпуска. Не все названия фильмов содержат год выпуска в одинаковом формате, поэтому используйте следующий алгоритм:

для каждой строки пройдите по всем годам списка years
если номер года присутствует в названии фильма, то функция возвращает этот год как год выпуска
если ни один из номеров года списка years не встретился в названии фильма, то возвращается 1900 год
Запишите год выпуска фильма по алгоритму пункта 2 в новый столбец ‘year’

Посчитайте средний рейтинг всех фильмов для каждого значения столбца ‘year’ и отсортируйте результат по убыванию рейтинга

In [46]:
years = list(range(1950,2011,1))

In [81]:
def production_year (title):
    years = list(range(1950,2011,1))
    for year in years:
        if str(year) in title:
            return year
    return '1900'

In [82]:
movies['year'] = movies.title.apply(production_year)
movies

       movieId  ...  year
0            1  ...  1995
1            2  ...  1995
2            3  ...  1995
3            4  ...  1995
4            5  ...  1995
...        ...  ...   ...
62418   209157  ...  1900
62419   209159  ...  2001
62420   209163  ...  1900
62421   209169  ...  2001
62422   209171  ...  1962

[62423 rows x 4 columns]

In [83]:
df_new = rating.merge(movies, on='movieId', how='left')[['title', 'rating', 'year']]
df_new.head(3)

                                              title  rating  year
0                               Pulp Fiction (1994)     5.0  1994
1  Three Colors: Red (Trois couleurs: Rouge) (1994)     3.5  1994
2  Three Colors: Blue (Trois couleurs: Bleu) (1993)     5.0  1993

In [84]:
df_new.groupby('year').mean().rating.sort_values(ascending=False).head(10)

year
1957    3.999492
1954    3.985693
1972    3.956477
1962    3.929445
1952    3.895315
1974    3.891385
1975    3.883071
1964    3.879177
1951    3.876258
1950    3.846525
Name: rating, dtype: float64